<script lang="ts" setup>
    // импорт роутера для перехода по странице
    import { useRouter } from 'vue-router';
    // импорт стора
    import { useAuthUser } from '@/stores/authUser';
    // импорт функций 
    import { onMounted } from 'vue';
    // импорт карты для поиска 
    import SearchCard from './SearchCard.vue';
    import { ref } from 'vue';

    const router = useRouter();
    const userData = useAuthUser();

    // загрузка данных из стора
    onMounted(() => {
        userData.loadUserFromLocalStorage()
    })

    // в зависимости от состояния кнопки меняется результат
    const handleButtonClick = () => {
        if(userData.name){
            router.push('/profile')
        }else{
            userData.OnShowLogin();
        }
    }

    const closeModal = (val: string) => {
        document.querySelectorAll('.auth__input-wrap').forEach(wrap => {
            wrap.querySelectorAll('input').forEach(input => {
                input.classList.remove('wrong__input');
                input.value = '';
            });

            wrap.querySelectorAll('svg').forEach(svg => {
                svg.classList.remove('wrong__svg');
            });
        });
        switch(val){
            case 'login':
                userData.offShowLogin();
            case 'reg':
                userData.offShowReg();
            case 'success':
                userData.offShowSuccess();
        }
    }

    const enterToReg = () => {
        userData.offShowLogin();
        userData.onShowReg();
    }

    const regToEnter = () => {
        userData.OnShowLogin();
        userData.offShowReg();
        userData.offShowSuccess();
    }

    // для проверки почты
    const checkEmail = (mail: string) => {
        return mail.includes('@') && mail.length > 6 && mail.length < 27
    }

    // для проверки имени и фамилий
    const checkFI = (val: string) => {
        return val.length > 2
    }

    // для проверки паролей
    const checkPass = (pas: string) => {
        return pas.length > 6
    }

    // регистрация пользователя
    const registerUser = (event: Event) => {
        event.preventDefault();

        const regEmail = document.getElementById('regEmail') as HTMLInputElement;
        const regName = document.getElementById('regName') as HTMLInputElement;
        const regLastName = document.getElementById('regLastName') as HTMLInputElement;
        const regPassword = document.getElementById('regPassword') as HTMLInputElement;

        if(checkEmail(regEmail.value) && checkFI(regName.value) && checkFI(regLastName.value) && checkPass(regPassword.value)){
            fetch('https://cinemaguide.skillbox.cc/user', {
                method: "POST",
                headers: {
                    'Content-Type': 'application/x-www-form-urlencoded',
                },
                body: new URLSearchParams({
                    email: regEmail.value,
                    password: regPassword.value,
                    name: regName.value,
                    lastName: regLastName.value,
                }),
            })
                .then(response => response.json())
                .then(data => {
                    console.log('Вход успешен', data)
                    localStorage.setItem('userName', regName.value);
                    localStorage.setItem('email', regEmail.value);
                    userData.offShowReg();
                    userData.onShowSuccess();
            })
        }else{
             // доабвления класса если не правильно набрано что либо
            document.querySelectorAll('.auth__input-wrap').forEach(wrap => {
                wrap.querySelectorAll('input').forEach(input => {
                    input.classList.add('wrong__input');
                });

                wrap.querySelectorAll('svg').forEach(svg => {
                    svg.classList.add('wrong__svg');
                });
            });
        }
    } 

    // логин по почте и паролю
    const loginUser = (event: Event) => {
        event.preventDefault();

        const loginEmail = document.getElementById('email') as HTMLInputElement;
        const loginPass = document.getElementById('password') as HTMLInputElement;
        if(checkEmail(loginEmail.value) && checkPass(loginPass.value)){
            fetch('https://cinemaguide.skillbox.cc/auth/login', {
                method: 'POST',
                headers: {
                    'Content-Type': 'application/x-www-form-urlencoded',
                },
                body: new URLSearchParams({
                    email: loginEmail.value,
                    password: loginPass.value
                }),
                credentials: 'include'
            })
            .then(response => response.json())
            .then(data => {
                console.log('Вход успешен', data)
                userData.offShowLogin()

                // сохраняем данные о пользователе в локал сторейдж
                fetch('https://cinemaguide.skillbox.cc/profile',{
                        credentials: 'include' // куки
                    })
                .then(response => response.json())
                .then(data => {
                    userData.loginUser(data.email, data.name, data.lastName, data.password)
                })
            })
        }else{
            // доабвления класса если не правильно набрано что либо
            document.querySelectorAll('.auth__input-wrap').forEach(wrap => {
                wrap.querySelectorAll('input').forEach(input => {
                    input.classList.add('wrong__input');
                });

                wrap.querySelectorAll('svg').forEach(svg => {
                    svg.classList.add('wrong__svg');
                });
            });
        }
    }

    const searchFilmsList = ref<[]>([]);

    // поиск 
    document.addEventListener('DOMContentLoaded', () => {
        // текущая страица 
        const path = window.location.pathname;
        console.log(path)
        switch(path){
            case '/':
                document.getElementById('navMain')?.classList.add('header__list-underline');
                break
            case '/genre':
                document.getElementById('navGenre')?.classList.add('header__list-underline');
                break
        }

        const searchInput = document.getElementById('searchInput') as HTMLInputElement;

        if(searchInput){
            searchInput.addEventListener('input', () => {
                const search = document.getElementById('search-wrap') as HTMLElement;
                if(searchInput.value === ''){
                    search.style.display = 'none';
                }else{
                    search.style.display = 'flex';
                }

                const title = searchInput.value.trim();

                const params = new URLSearchParams({
                    title: title,
                    count: '15'
                })
                fetch(`https://cinemaguide.skillbox.cc/movie?${params}`)
                    .then(response => response.json())
                    .then(data => {
                        searchFilmsList.value = data.map((film: any) => film)
                    })
                    .catch(error => {
                        console.error('Произошла ошибка:', error);
                    });
            })
        }
    })
</script>

<template>
    <header class="header">
        <!-- logo -->
        <a class="logo header__logo" href="/">
            <img class="logo__image" src="../assets/img/logo.png" alt="logo маруся">
            <svg class="logo__svg" width="101" height="22" viewBox="0 0 101 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M28.2036 0.571411C30.1084 0.571411 31.6036 1.17141 32.6893 2.37141C33.7941 3.55236 34.3465 5.21903 34.3465 7.37141V15.7143H31.9179L31.2322 13.3714C30.8132 14.0762 30.1941 14.6952 29.3751 15.2286C28.556 15.7428 27.5846 16 26.4608 16C25.4703 16 24.5751 15.8 23.7751 15.4C22.9941 15 22.3846 14.4381 21.9465 13.7143C21.5084 12.9905 21.2893 12.1714 21.2893 11.2571C21.2893 9.8476 21.8417 8.72379 22.9465 7.8857C24.0703 7.02855 25.6989 6.59998 27.8322 6.59998H31.0322C30.956 5.60951 30.6512 4.82855 30.1179 4.25713C29.6036 3.66665 28.9084 3.37141 28.0322 3.37141C27.3274 3.37141 26.7179 3.54284 26.2036 3.8857C25.6893 4.22855 25.3084 4.6476 25.0608 5.14284L22.0322 4.62855C22.3941 3.37141 23.137 2.38094 24.2608 1.65713C25.4036 0.933316 26.7179 0.571411 28.2036 0.571411ZM27.2322 13.2286C28.3751 13.2286 29.2989 12.8571 30.0036 12.1143C30.7084 11.3714 31.0608 10.3905 31.0608 9.17141H27.9465C25.7179 9.17141 24.6036 9.81903 24.6036 11.1143C24.6036 11.7619 24.8417 12.2762 25.3179 12.6571C25.7941 13.0381 26.4322 13.2286 27.2322 13.2286ZM37.911 0.857125V21.5714H41.1967V13.4571C41.7872 14.1809 42.5491 14.7905 43.4824 15.2857C44.4158 15.7619 45.4824 16 46.6824 16C48.0729 16 49.3205 15.6762 50.4253 15.0286C51.53 14.3619 52.3872 13.4476 52.9967 12.2857C53.6253 11.1047 53.9396 9.77141 53.9396 8.2857C53.9396 6.79998 53.6253 5.47617 52.9967 4.31427C52.3872 3.13332 51.53 2.21903 50.4253 1.57141C49.3205 0.904745 48.0729 0.571411 46.6824 0.571411C45.4443 0.571411 44.3491 0.838078 43.3967 1.37141C42.4443 1.8857 41.6634 2.51427 41.0538 3.25713L40.3681 0.857125H37.911ZM49.2253 11.7428C48.3681 12.619 47.2538 13.0571 45.8824 13.0571C44.4919 13.0571 43.3586 12.619 42.4824 11.7428C41.6253 10.8476 41.1967 9.69522 41.1967 8.2857C41.1967 6.87617 41.6253 5.73332 42.4824 4.85713C43.3586 3.96189 44.4919 3.51427 45.8824 3.51427C47.2538 3.51427 48.3681 3.96189 49.2253 4.85713C50.0824 5.73332 50.511 6.87617 50.511 8.2857C50.511 9.69522 50.0824 10.8476 49.2253 11.7428ZM74.9206 15.0286C76.1015 15.6762 77.4349 16 78.9206 16C80.5396 16 82.0063 15.5905 83.3206 14.7714C84.6349 13.9524 85.5587 12.7905 86.092 11.2857L83.0063 10.7714C82.6634 11.4381 82.1492 11.9809 81.4634 12.4C80.7777 12.8 79.9968 13 79.1206 13C77.7873 13 76.7015 12.5619 75.8634 11.6857C75.0254 10.8095 74.6063 9.67617 74.6063 8.2857C74.6063 6.89522 75.0254 5.76189 75.8634 4.8857C76.7015 4.00951 77.7873 3.57141 79.1206 3.57141C79.9587 3.57141 80.7111 3.77141 81.3777 4.17141C82.0635 4.57141 82.5682 5.09522 82.892 5.74284L85.9777 5.22855C85.4444 3.74284 84.5396 2.59998 83.2635 1.79998C82.0063 0.980936 80.5587 0.571411 78.9206 0.571411C77.4349 0.571411 76.1015 0.904745 74.9206 1.57141C73.7396 2.21903 72.8158 3.13332 72.1492 4.31427C71.5015 5.47617 71.1777 6.79998 71.1777 8.2857C71.1777 9.77141 71.5015 11.1047 72.1492 12.2857C72.8158 13.4476 73.7396 14.3619 74.9206 15.0286ZM97.0425 15.7143H100.328V0.857125H93.7282C92.6234 0.857125 91.6329 1.07617 90.7567 1.51427C89.8806 1.93332 89.1948 2.52379 88.6996 3.2857C88.2044 4.0476 87.9567 4.91427 87.9567 5.8857C87.9567 6.93332 88.2329 7.85712 88.7853 8.65712C89.3377 9.45712 90.0996 10.0476 91.071 10.4286L87.5282 15.7143H91.271L94.4139 10.9428H97.0425V15.7143ZM97.0425 3.71427V8.0857H93.7282C92.9853 8.0857 92.3853 7.8857 91.9282 7.4857C91.471 7.0857 91.2425 6.55236 91.2425 5.8857C91.2425 5.23808 91.471 4.71427 91.9282 4.31427C92.3853 3.91427 92.9853 3.71427 93.7282 3.71427H97.0425ZM66.8139 0.857125H70.1568L64.071 17.5714C63.5568 18.9809 62.8901 20 62.071 20.6286C61.271 21.2571 60.1948 21.5714 58.8425 21.5714H56.5853L56.2996 18.5714H59.071C59.6234 18.5714 60.0425 18.4476 60.3282 18.2C60.6329 17.9714 60.8901 17.5619 61.0996 16.9714L61.271 16.5143L54.671 0.857125H58.1853L62.5567 11.5714H63.0139L66.8139 0.857125ZM0.857422 15.7143H4.00028V4.6857H4.45742L8.17171 15.7143H10.9431L14.8289 4.6857H15.286V15.7143H18.4288V0.857125H13.4288L9.85742 11.0571H9.40028L5.97171 0.857125H0.857422V15.7143Z" fill="white"/>
            </svg>
        </a>
        <!-- навигация и поиск -->
        <div class="header__content">
            <nav class="header__nav nav">
                <ul class="header__list">
                    <li class="header__list-item">
                        <a id="navMain" class="header__list-link" href="/">Главная</a>
                    </li>
                    <li class="header__list-item">
                        <a id="navGenre" class="header__list-link" href="/genre">Жанры</a>
                    </li>
                </ul>
            </nav>
            <div class="header__search" >
                <input class="header__search--input" id="searchInput" placeholder="Поиск" type="text" @click="">
                <svg class="header__search--lupa" width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M16.3591 14.6168L20.6418 18.8995L19.2276 20.3137L14.9449 16.031C13.405 17.263 11.4521 18 9.32812 18C4.36013 18 0.328125 13.968 0.328125 9C0.328125 4.032 4.36013 0 9.32812 0C14.2961 0 18.3281 4.032 18.3281 9C18.3281 11.124 17.5911 13.0769 16.3591 14.6168ZM14.3528 13.8748C15.5756 12.6146 16.3281 10.8956 16.3281 9C16.3281 5.1325 13.1956 2 9.32812 2C5.46062 2 2.32812 5.1325 2.32812 9C2.32812 12.8675 5.46062 16 9.32812 16C11.2237 16 12.9427 15.2475 14.2029 14.0247L14.3528 13.8748Z" fill="white" fill-opacity="0.5"/>
                </svg>
                <!-- поиск -->
                <div  class="search" id="search-wrap">
                    <ul class="search__list">
                        <SearchCard
                            v-for="(film, index) in searchFilmsList"
                                :key="index"
                                :data="film"
                        />
                    </ul>
                </div>
            </div>
        </div>
        <!-- кнопка войти -->
        <button class="header__btn" @click="handleButtonClick">
            {{ userData.name ? userData.name : 'Войти' }}
        </button>
        <!-- мобилка -->
        <nav class="header__nav-mobile">
            <a href="/genre">
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M7 11.5C4.51472 11.5 2.5 9.48528 2.5 7C2.5 4.51472 4.51472 2.5 7 2.5C9.48528 2.5 11.5 4.51472 11.5 7C11.5 9.48528 9.48528 11.5 7 11.5ZM7 21.5C4.51472 21.5 2.5 19.4853 2.5 17C2.5 14.5147 4.51472 12.5 7 12.5C9.48528 12.5 11.5 14.5147 11.5 17C11.5 19.4853 9.48528 21.5 7 21.5ZM17 11.5C14.5147 11.5 12.5 9.48528 12.5 7C12.5 4.51472 14.5147 2.5 17 2.5C19.4853 2.5 21.5 4.51472 21.5 7C21.5 9.48528 19.4853 11.5 17 11.5ZM17 21.5C14.5147 21.5 12.5 19.4853 12.5 17C12.5 14.5147 14.5147 12.5 17 12.5C19.4853 12.5 21.5 14.5147 21.5 17C21.5 19.4853 19.4853 21.5 17 21.5ZM7 9.5C8.38071 9.5 9.5 8.38071 9.5 7C9.5 5.61929 8.38071 4.5 7 4.5C5.61929 4.5 4.5 5.61929 4.5 7C4.5 8.38071 5.61929 9.5 7 9.5ZM7 19.5C8.38071 19.5 9.5 18.3807 9.5 17C9.5 15.6193 8.38071 14.5 7 14.5C5.61929 14.5 4.5 15.6193 4.5 17C4.5 18.3807 5.61929 19.5 7 19.5ZM17 9.5C18.3807 9.5 19.5 8.38071 19.5 7C19.5 5.61929 18.3807 4.5 17 4.5C15.6193 4.5 14.5 5.61929 14.5 7C14.5 8.38071 15.6193 9.5 17 9.5ZM17 19.5C18.3807 19.5 19.5 18.3807 19.5 17C19.5 15.6193 18.3807 14.5 17 14.5C15.6193 14.5 14.5 15.6193 14.5 17C14.5 18.3807 15.6193 19.5 17 19.5Z" fill="white"/>
                </svg>
            </a>
            <a href="#">
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M18.031 16.6168L22.3137 20.8995L20.8995 22.3137L16.6168 18.031C15.0769 19.263 13.124 20 11 20C6.032 20 2 15.968 2 11C2 6.032 6.032 2 11 2C15.968 2 20 6.032 20 11C20 13.124 19.263 15.0769 18.031 16.6168ZM16.0247 15.8748C17.2475 14.6146 18 12.8956 18 11C18 7.1325 14.8675 4 11 4C7.1325 4 4 7.1325 4 11C4 14.8675 7.1325 18 11 18C12.8956 18 14.6146 17.2475 15.8748 16.0247L16.0247 15.8748Z" fill="white"/>
                </svg>
            </a>
            <a href="#">
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M4 22C4 17.5817 7.58172 14 12 14C16.4183 14 20 17.5817 20 22H18C18 18.6863 15.3137 16 12 16C8.68629 16 6 18.6863 6 22H4ZM12 13C8.685 13 6 10.315 6 7C6 3.685 8.685 1 12 1C15.315 1 18 3.685 18 7C18 10.315 15.315 13 12 13ZM12 11C14.21 11 16 9.21 16 7C16 4.79 14.21 3 12 3C9.79 3 8 4.79 8 7C8 9.21 9.79 11 12 11Z" fill="white"/>
                </svg>
            </a>
        </nav>
        <!-- модальное окно для входа по почте и паролю -->
        <div class="auth" v-show="userData.showLoginModal" id="auth-background">
            <div class="auth__content">
                <!-- лого и маруся -->
                <span class="auth__logo">
                    <img class="logo__image" src="../assets/img/logo.png" alt="logo маруся">
                    <svg width="110" height="24" viewBox="0 0 110 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M30.4959 0.375C32.5792 0.375 34.2146 1.03125 35.4021 2.34375C36.6104 3.63542 37.2146 5.45833 37.2146 7.8125V16.9375H34.5583L33.8084 14.375C33.35 15.1458 32.6729 15.8229 31.7771 16.4062C30.8813 16.9688 29.8188 17.25 28.5896 17.25C27.5063 17.25 26.5271 17.0312 25.6521 16.5938C24.7979 16.1562 24.1313 15.5417 23.6521 14.75C23.1729 13.9583 22.9333 13.0625 22.9333 12.0625C22.9333 10.5208 23.5375 9.29167 24.7459 8.375C25.975 7.4375 27.7563 6.96875 30.0896 6.96875H33.5896C33.5063 5.88542 33.1729 5.03125 32.5896 4.40625C32.0271 3.76042 31.2667 3.4375 30.3084 3.4375C29.5375 3.4375 28.8709 3.625 28.3084 4C27.7459 4.375 27.3292 4.83333 27.0584 5.375L23.7458 4.8125C24.1417 3.4375 24.9542 2.35417 26.1834 1.5625C27.4334 0.770834 28.8709 0.375 30.4959 0.375ZM29.4334 14.2188C30.6834 14.2188 31.6938 13.8125 32.4646 13C33.2354 12.1875 33.6208 11.1146 33.6208 9.78125H30.2146C27.7771 9.78125 26.5583 10.4896 26.5583 11.9063C26.5583 12.6146 26.8188 13.1771 27.3396 13.5937C27.8604 14.0104 28.5584 14.2188 29.4334 14.2188ZM41.1133 0.6875V23.3438H44.707V14.4688C45.3529 15.2604 46.1862 15.9271 47.207 16.4688C48.2279 16.9896 49.3945 17.25 50.707 17.25C52.2279 17.25 53.5924 16.8958 54.8008 16.1875C56.0091 15.4583 56.9466 14.4583 57.6133 13.1875C58.3008 11.8958 58.6445 10.4375 58.6445 8.8125C58.6445 7.1875 58.3008 5.73958 57.6133 4.46875C56.9466 3.17708 56.0091 2.17708 54.8008 1.46875C53.5924 0.739583 52.2279 0.375 50.707 0.375C49.3529 0.375 48.1549 0.666667 47.1133 1.25C46.0716 1.8125 45.2174 2.5 44.5508 3.3125L43.8008 0.6875H41.1133ZM53.4883 12.5938C52.5508 13.5521 51.332 14.0312 49.832 14.0312C48.3112 14.0312 47.0716 13.5521 46.1133 12.5938C45.1758 11.6146 44.707 10.3542 44.707 8.8125C44.707 7.27083 45.1758 6.02083 46.1133 5.0625C47.0716 4.08333 48.3112 3.59375 49.832 3.59375C51.332 3.59375 52.5508 4.08333 53.4883 5.0625C54.4258 6.02083 54.8945 7.27083 54.8945 8.8125C54.8945 10.3542 54.4258 11.6146 53.4883 12.5938ZM81.5925 16.1875C82.8842 16.8958 84.3425 17.25 85.9675 17.25C87.7384 17.25 89.3425 16.8021 90.78 15.9062C92.2175 15.0104 93.228 13.7396 93.8113 12.0938L90.4363 11.5312C90.0613 12.2604 89.4988 12.8542 88.7488 13.3125C87.9988 13.75 87.1446 13.9688 86.1863 13.9688C84.7279 13.9688 83.5404 13.4896 82.6238 12.5313C81.7071 11.5729 81.2488 10.3333 81.2488 8.8125C81.2488 7.29167 81.7071 6.05208 82.6238 5.09375C83.5404 4.13542 84.7279 3.65625 86.1863 3.65625C87.1029 3.65625 87.9259 3.875 88.655 4.3125C89.405 4.75 89.9571 5.32292 90.3113 6.03125L93.6863 5.46875C93.103 3.84375 92.1134 2.59375 90.7175 1.71875C89.3425 0.822917 87.7592 0.375 85.9675 0.375C84.3425 0.375 82.8842 0.739583 81.5925 1.46875C80.3009 2.17708 79.2904 3.17708 78.5613 4.46875C77.8529 5.73958 77.4988 7.1875 77.4988 8.8125C77.4988 10.4375 77.8529 11.8958 78.5613 13.1875C79.2904 14.4583 80.3009 15.4583 81.5925 16.1875ZM105.788 16.9375H109.382V0.6875H102.163C100.955 0.6875 99.8717 0.927084 98.9133 1.40625C97.955 1.86458 97.205 2.51042 96.6633 3.34375C96.1217 4.17708 95.8508 5.125 95.8508 6.1875C95.8508 7.33333 96.1529 8.34375 96.7571 9.21875C97.3612 10.0937 98.1946 10.7396 99.2571 11.1562L95.3821 16.9375H99.4758L102.913 11.7187H105.788V16.9375ZM105.788 3.8125V8.59375H102.163C101.351 8.59375 100.695 8.375 100.195 7.9375C99.6946 7.5 99.4446 6.91667 99.4446 6.1875C99.4446 5.47917 99.6946 4.90625 100.195 4.46875C100.695 4.03125 101.351 3.8125 102.163 3.8125H105.788ZM72.7258 0.6875H76.3821L69.7258 18.9688C69.1633 20.5104 68.4342 21.625 67.5383 22.3125C66.6633 23 65.4863 23.3438 64.0071 23.3438H61.5383L61.2258 20.0625H64.2571C64.8612 20.0625 65.3196 19.9271 65.6321 19.6562C65.9654 19.4062 66.2467 18.9583 66.4758 18.3125L66.6633 17.8125L59.4446 0.6875H63.2883L68.0696 12.4063H68.5696L72.7258 0.6875ZM0.585938 16.9375H4.02344V4.875H4.52344L8.58594 16.9375H11.6172L15.8672 4.875H16.3672V16.9375H19.8047V0.6875H14.3359L10.4297 11.8437H9.92969L6.17969 0.6875H0.585938V16.9375Z" fill="black"/>
                    </svg>
                </span>
                <h3 class="auth__title" >Регистрация</h3>
                <!-- форма -->
                <form id="form" class="auth__form">
                    <div class="auth__inputs">
                        <div class="auth__input-wrap">
                            <input class="auth__input" id="email" type="email" placeholder="Электронная почта" required name="email">
                            <svg class="auth__input--svg" width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M21 3C21.5523 3 22 3.44772 22 4V20.0066C22 20.5552 21.5447 21 21.0082 21H2.9918C2.44405 21 2 20.5551 2 20.0066V19H20V7.3L12 14.5L2 5.5V4C2 3.44772 2.44772 3 3 3H21ZM8 15V17H0V15H8ZM5 10V12H0V10H5ZM19.5659 5H4.43414L12 11.8093L19.5659 5Z" fill-opacity="0.4"/>
                            </svg>
                        </div>
                        <div class="auth__input-wrap">
                            <input class="auth__input" id="password" type="password" placeholder="Пароль" required name="password">
                            <svg class="auth__input--svg" width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M12.917 13C12.441 15.8377 9.973 18 7 18C3.68629 18 1 15.3137 1 12C1 8.68629 3.68629 6 7 6C9.973 6 12.441 8.16229 12.917 11H23V13H21V17H19V13H17V17H15V13H12.917ZM7 16C9.20914 16 11 14.2091 11 12C11 9.79086 9.20914 8 7 8C4.79086 8 3 9.79086 3 12C3 14.2091 4.79086 16 7 16Z" fill-opacity="0.4"/>
                            </svg>
                        </div>
                    </div>
                    <!-- кнопка для входа по email и паролю -->
                    <button class="auth__login" @click="loginUser">Войти</button>
                    <!-- кнопка для открытия более детального модального окна -->
                    <button class="auth__register" @click="enterToReg">Регистрация</button>
                </form>
                <!-- закрытие модального окна -->
                <span class="auth__close" @click="closeModal('login')">
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M10.5859 12L2.79297 4.20706L4.20718 2.79285L12.0001 10.5857L19.793 2.79285L21.2072 4.20706L13.4143 12L21.2072 19.7928L19.793 21.2071L12.0001 13.4142L4.20718 21.2071L2.79297 19.7928L10.5859 12Z" fill="black"/>
                    </svg>
                </span>
            </div>
        </div>
        <!-- модалка для регистраций пользователя -->
        <div class="auth" v-show="userData.showRegModal" id="reg-background">
            <div class="auth__content">
                <!-- лого и маруся -->
                <span class="auth__logo">
                    <img class="logo__image" src="../assets/img/logo.png" alt="logo маруся">
                    <svg width="110" height="24" viewBox="0 0 110 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M30.4959 0.375C32.5792 0.375 34.2146 1.03125 35.4021 2.34375C36.6104 3.63542 37.2146 5.45833 37.2146 7.8125V16.9375H34.5583L33.8084 14.375C33.35 15.1458 32.6729 15.8229 31.7771 16.4062C30.8813 16.9688 29.8188 17.25 28.5896 17.25C27.5063 17.25 26.5271 17.0312 25.6521 16.5938C24.7979 16.1562 24.1313 15.5417 23.6521 14.75C23.1729 13.9583 22.9333 13.0625 22.9333 12.0625C22.9333 10.5208 23.5375 9.29167 24.7459 8.375C25.975 7.4375 27.7563 6.96875 30.0896 6.96875H33.5896C33.5063 5.88542 33.1729 5.03125 32.5896 4.40625C32.0271 3.76042 31.2667 3.4375 30.3084 3.4375C29.5375 3.4375 28.8709 3.625 28.3084 4C27.7459 4.375 27.3292 4.83333 27.0584 5.375L23.7458 4.8125C24.1417 3.4375 24.9542 2.35417 26.1834 1.5625C27.4334 0.770834 28.8709 0.375 30.4959 0.375ZM29.4334 14.2188C30.6834 14.2188 31.6938 13.8125 32.4646 13C33.2354 12.1875 33.6208 11.1146 33.6208 9.78125H30.2146C27.7771 9.78125 26.5583 10.4896 26.5583 11.9063C26.5583 12.6146 26.8188 13.1771 27.3396 13.5937C27.8604 14.0104 28.5584 14.2188 29.4334 14.2188ZM41.1133 0.6875V23.3438H44.707V14.4688C45.3529 15.2604 46.1862 15.9271 47.207 16.4688C48.2279 16.9896 49.3945 17.25 50.707 17.25C52.2279 17.25 53.5924 16.8958 54.8008 16.1875C56.0091 15.4583 56.9466 14.4583 57.6133 13.1875C58.3008 11.8958 58.6445 10.4375 58.6445 8.8125C58.6445 7.1875 58.3008 5.73958 57.6133 4.46875C56.9466 3.17708 56.0091 2.17708 54.8008 1.46875C53.5924 0.739583 52.2279 0.375 50.707 0.375C49.3529 0.375 48.1549 0.666667 47.1133 1.25C46.0716 1.8125 45.2174 2.5 44.5508 3.3125L43.8008 0.6875H41.1133ZM53.4883 12.5938C52.5508 13.5521 51.332 14.0312 49.832 14.0312C48.3112 14.0312 47.0716 13.5521 46.1133 12.5938C45.1758 11.6146 44.707 10.3542 44.707 8.8125C44.707 7.27083 45.1758 6.02083 46.1133 5.0625C47.0716 4.08333 48.3112 3.59375 49.832 3.59375C51.332 3.59375 52.5508 4.08333 53.4883 5.0625C54.4258 6.02083 54.8945 7.27083 54.8945 8.8125C54.8945 10.3542 54.4258 11.6146 53.4883 12.5938ZM81.5925 16.1875C82.8842 16.8958 84.3425 17.25 85.9675 17.25C87.7384 17.25 89.3425 16.8021 90.78 15.9062C92.2175 15.0104 93.228 13.7396 93.8113 12.0938L90.4363 11.5312C90.0613 12.2604 89.4988 12.8542 88.7488 13.3125C87.9988 13.75 87.1446 13.9688 86.1863 13.9688C84.7279 13.9688 83.5404 13.4896 82.6238 12.5313C81.7071 11.5729 81.2488 10.3333 81.2488 8.8125C81.2488 7.29167 81.7071 6.05208 82.6238 5.09375C83.5404 4.13542 84.7279 3.65625 86.1863 3.65625C87.1029 3.65625 87.9259 3.875 88.655 4.3125C89.405 4.75 89.9571 5.32292 90.3113 6.03125L93.6863 5.46875C93.103 3.84375 92.1134 2.59375 90.7175 1.71875C89.3425 0.822917 87.7592 0.375 85.9675 0.375C84.3425 0.375 82.8842 0.739583 81.5925 1.46875C80.3009 2.17708 79.2904 3.17708 78.5613 4.46875C77.8529 5.73958 77.4988 7.1875 77.4988 8.8125C77.4988 10.4375 77.8529 11.8958 78.5613 13.1875C79.2904 14.4583 80.3009 15.4583 81.5925 16.1875ZM105.788 16.9375H109.382V0.6875H102.163C100.955 0.6875 99.8717 0.927084 98.9133 1.40625C97.955 1.86458 97.205 2.51042 96.6633 3.34375C96.1217 4.17708 95.8508 5.125 95.8508 6.1875C95.8508 7.33333 96.1529 8.34375 96.7571 9.21875C97.3612 10.0937 98.1946 10.7396 99.2571 11.1562L95.3821 16.9375H99.4758L102.913 11.7187H105.788V16.9375ZM105.788 3.8125V8.59375H102.163C101.351 8.59375 100.695 8.375 100.195 7.9375C99.6946 7.5 99.4446 6.91667 99.4446 6.1875C99.4446 5.47917 99.6946 4.90625 100.195 4.46875C100.695 4.03125 101.351 3.8125 102.163 3.8125H105.788ZM72.7258 0.6875H76.3821L69.7258 18.9688C69.1633 20.5104 68.4342 21.625 67.5383 22.3125C66.6633 23 65.4863 23.3438 64.0071 23.3438H61.5383L61.2258 20.0625H64.2571C64.8612 20.0625 65.3196 19.9271 65.6321 19.6562C65.9654 19.4062 66.2467 18.9583 66.4758 18.3125L66.6633 17.8125L59.4446 0.6875H63.2883L68.0696 12.4063H68.5696L72.7258 0.6875ZM0.585938 16.9375H4.02344V4.875H4.52344L8.58594 16.9375H11.6172L15.8672 4.875H16.3672V16.9375H19.8047V0.6875H14.3359L10.4297 11.8437H9.92969L6.17969 0.6875H0.585938V16.9375Z" fill="black"/>
                    </svg>
                </span>
                <h3 class="auth__title" >Регистрация</h3>
                <!-- форма -->
                <form id="regForm" class="auth__form">
                    <div class="auth__inputs">
                        <div class="auth__input-wrap">
                            <input class="auth__input" id="regEmail" type="email" placeholder="Электронная почта" required name="reg_email">
                            <svg class="auth__input--svg" width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M21 3C21.5523 3 22 3.44772 22 4V20.0066C22 20.5552 21.5447 21 21.0082 21H2.9918C2.44405 21 2 20.5551 2 20.0066V19H20V7.3L12 14.5L2 5.5V4C2 3.44772 2.44772 3 3 3H21ZM8 15V17H0V15H8ZM5 10V12H0V10H5ZM19.5659 5H4.43414L12 11.8093L19.5659 5Z" fill-opacity="0.4"/>
                            </svg>
                        </div>
                        <div class="auth__input-wrap">
                            <input class="auth__input" id="regName" type="text" placeholder="Имя" required name="reg_name">
                            <svg class="auth__input--svg" width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M4 22.75C4 18.3317 7.58172 14.75 12 14.75C16.4183 14.75 20 18.3317 20 22.75H18C18 19.4363 15.3137 16.75 12 16.75C8.68629 16.75 6 19.4363 6 22.75H4ZM12 13.75C8.685 13.75 6 11.065 6 7.75C6 4.435 8.685 1.75 12 1.75C15.315 1.75 18 4.435 18 7.75C18 11.065 15.315 13.75 12 13.75ZM12 11.75C14.21 11.75 16 9.96 16 7.75C16 5.54 14.21 3.75 12 3.75C9.79 3.75 8 5.54 8 7.75C8 9.96 9.79 11.75 12 11.75Z" fill-opacity="0.4"/>
                            </svg>
                        </div>
                        <div class="auth__input-wrap">
                            <input class="auth__input" id="regLastName" type="text" placeholder="Фамилия" required name="reg_surName">
                            <svg class="auth__input--svg" width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M4 22.75C4 18.3317 7.58172 14.75 12 14.75C16.4183 14.75 20 18.3317 20 22.75H18C18 19.4363 15.3137 16.75 12 16.75C8.68629 16.75 6 19.4363 6 22.75H4ZM12 13.75C8.685 13.75 6 11.065 6 7.75C6 4.435 8.685 1.75 12 1.75C15.315 1.75 18 4.435 18 7.75C18 11.065 15.315 13.75 12 13.75ZM12 11.75C14.21 11.75 16 9.96 16 7.75C16 5.54 14.21 3.75 12 3.75C9.79 3.75 8 5.54 8 7.75C8 9.96 9.79 11.75 12 11.75Z" fill-opacity="0.4"/>
                            </svg>
                        </div>
                        <div class="auth__input-wrap">
                            <input class="auth__input" id="regPassword" type="password" placeholder="Пароль" required name="reg_pass">
                            <svg class="auth__input--svg" width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M12.917 13C12.441 15.8377 9.973 18 7 18C3.68629 18 1 15.3137 1 12C1 8.68629 3.68629 6 7 6C9.973 6 12.441 8.16229 12.917 11H23V13H21V17H19V13H17V17H15V13H12.917ZM7 16C9.20914 16 11 14.2091 11 12C11 9.79086 9.20914 8 7 8C4.79086 8 3 9.79086 3 12C3 14.2091 4.79086 16 7 16Z"  fill-opacity="0.4"/>
                            </svg>
                        </div>
                        <div class="auth__input-wrap">
                            <input class="auth__input" id="regRepPass" type="password" placeholder="Подтвердите пароль" required name="reg_repPass">
                            <svg class="auth__input--svg" width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M12.917 13C12.441 15.8377 9.973 18 7 18C3.68629 18 1 15.3137 1 12C1 8.68629 3.68629 6 7 6C9.973 6 12.441 8.16229 12.917 11H23V13H21V17H19V13H17V17H15V13H12.917ZM7 16C9.20914 16 11 14.2091 11 12C11 9.79086 9.20914 8 7 8C4.79086 8 3 9.79086 3 12C3 14.2091 4.79086 16 7 16Z" fill-opacity="0.4"/>
                            </svg>
                        </div>
                    </div>
                    <!-- кнопка для входа по email и паролю -->
                    <button class="auth__login" @click="registerUser">Создать аккаунт</button>
                    <!-- кнопка для открытия более детального модального окна -->
                    <button class="auth__register" @click="regToEnter">У меня есть пароль</button>
                </form>
                <!-- закрытие модального окна -->
                <span class="auth__close" @click="closeModal('reg')">
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M10.5859 12L2.79297 4.20706L4.20718 2.79285L12.0001 10.5857L19.793 2.79285L21.2072 4.20706L13.4143 12L21.2072 19.7928L19.793 21.2071L12.0001 13.4142L4.20718 21.2071L2.79297 19.7928L10.5859 12Z" fill="black"/>
                    </svg>
                </span>
            </div>
        </div>
        <!-- после удачной регистраций -->
        <div class="auth" v-show="userData.successReg" id="afterReg-background">
            <div class="auth__content">
                <!-- лого и маруся -->
                <span class="auth__logo">
                    <img class="logo__image" src="../assets/img/logo.png" alt="logo маруся">
                    <svg width="110" height="24" viewBox="0 0 110 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M30.4959 0.375C32.5792 0.375 34.2146 1.03125 35.4021 2.34375C36.6104 3.63542 37.2146 5.45833 37.2146 7.8125V16.9375H34.5583L33.8084 14.375C33.35 15.1458 32.6729 15.8229 31.7771 16.4062C30.8813 16.9688 29.8188 17.25 28.5896 17.25C27.5063 17.25 26.5271 17.0312 25.6521 16.5938C24.7979 16.1562 24.1313 15.5417 23.6521 14.75C23.1729 13.9583 22.9333 13.0625 22.9333 12.0625C22.9333 10.5208 23.5375 9.29167 24.7459 8.375C25.975 7.4375 27.7563 6.96875 30.0896 6.96875H33.5896C33.5063 5.88542 33.1729 5.03125 32.5896 4.40625C32.0271 3.76042 31.2667 3.4375 30.3084 3.4375C29.5375 3.4375 28.8709 3.625 28.3084 4C27.7459 4.375 27.3292 4.83333 27.0584 5.375L23.7458 4.8125C24.1417 3.4375 24.9542 2.35417 26.1834 1.5625C27.4334 0.770834 28.8709 0.375 30.4959 0.375ZM29.4334 14.2188C30.6834 14.2188 31.6938 13.8125 32.4646 13C33.2354 12.1875 33.6208 11.1146 33.6208 9.78125H30.2146C27.7771 9.78125 26.5583 10.4896 26.5583 11.9063C26.5583 12.6146 26.8188 13.1771 27.3396 13.5937C27.8604 14.0104 28.5584 14.2188 29.4334 14.2188ZM41.1133 0.6875V23.3438H44.707V14.4688C45.3529 15.2604 46.1862 15.9271 47.207 16.4688C48.2279 16.9896 49.3945 17.25 50.707 17.25C52.2279 17.25 53.5924 16.8958 54.8008 16.1875C56.0091 15.4583 56.9466 14.4583 57.6133 13.1875C58.3008 11.8958 58.6445 10.4375 58.6445 8.8125C58.6445 7.1875 58.3008 5.73958 57.6133 4.46875C56.9466 3.17708 56.0091 2.17708 54.8008 1.46875C53.5924 0.739583 52.2279 0.375 50.707 0.375C49.3529 0.375 48.1549 0.666667 47.1133 1.25C46.0716 1.8125 45.2174 2.5 44.5508 3.3125L43.8008 0.6875H41.1133ZM53.4883 12.5938C52.5508 13.5521 51.332 14.0312 49.832 14.0312C48.3112 14.0312 47.0716 13.5521 46.1133 12.5938C45.1758 11.6146 44.707 10.3542 44.707 8.8125C44.707 7.27083 45.1758 6.02083 46.1133 5.0625C47.0716 4.08333 48.3112 3.59375 49.832 3.59375C51.332 3.59375 52.5508 4.08333 53.4883 5.0625C54.4258 6.02083 54.8945 7.27083 54.8945 8.8125C54.8945 10.3542 54.4258 11.6146 53.4883 12.5938ZM81.5925 16.1875C82.8842 16.8958 84.3425 17.25 85.9675 17.25C87.7384 17.25 89.3425 16.8021 90.78 15.9062C92.2175 15.0104 93.228 13.7396 93.8113 12.0938L90.4363 11.5312C90.0613 12.2604 89.4988 12.8542 88.7488 13.3125C87.9988 13.75 87.1446 13.9688 86.1863 13.9688C84.7279 13.9688 83.5404 13.4896 82.6238 12.5313C81.7071 11.5729 81.2488 10.3333 81.2488 8.8125C81.2488 7.29167 81.7071 6.05208 82.6238 5.09375C83.5404 4.13542 84.7279 3.65625 86.1863 3.65625C87.1029 3.65625 87.9259 3.875 88.655 4.3125C89.405 4.75 89.9571 5.32292 90.3113 6.03125L93.6863 5.46875C93.103 3.84375 92.1134 2.59375 90.7175 1.71875C89.3425 0.822917 87.7592 0.375 85.9675 0.375C84.3425 0.375 82.8842 0.739583 81.5925 1.46875C80.3009 2.17708 79.2904 3.17708 78.5613 4.46875C77.8529 5.73958 77.4988 7.1875 77.4988 8.8125C77.4988 10.4375 77.8529 11.8958 78.5613 13.1875C79.2904 14.4583 80.3009 15.4583 81.5925 16.1875ZM105.788 16.9375H109.382V0.6875H102.163C100.955 0.6875 99.8717 0.927084 98.9133 1.40625C97.955 1.86458 97.205 2.51042 96.6633 3.34375C96.1217 4.17708 95.8508 5.125 95.8508 6.1875C95.8508 7.33333 96.1529 8.34375 96.7571 9.21875C97.3612 10.0937 98.1946 10.7396 99.2571 11.1562L95.3821 16.9375H99.4758L102.913 11.7187H105.788V16.9375ZM105.788 3.8125V8.59375H102.163C101.351 8.59375 100.695 8.375 100.195 7.9375C99.6946 7.5 99.4446 6.91667 99.4446 6.1875C99.4446 5.47917 99.6946 4.90625 100.195 4.46875C100.695 4.03125 101.351 3.8125 102.163 3.8125H105.788ZM72.7258 0.6875H76.3821L69.7258 18.9688C69.1633 20.5104 68.4342 21.625 67.5383 22.3125C66.6633 23 65.4863 23.3438 64.0071 23.3438H61.5383L61.2258 20.0625H64.2571C64.8612 20.0625 65.3196 19.9271 65.6321 19.6562C65.9654 19.4062 66.2467 18.9583 66.4758 18.3125L66.6633 17.8125L59.4446 0.6875H63.2883L68.0696 12.4063H68.5696L72.7258 0.6875ZM0.585938 16.9375H4.02344V4.875H4.52344L8.58594 16.9375H11.6172L15.8672 4.875H16.3672V16.9375H19.8047V0.6875H14.3359L10.4297 11.8437H9.92969L6.17969 0.6875H0.585938V16.9375Z" fill="black"/>
                    </svg>
                </span>
                <h3 class="auth__title" >Регистрация завершена</h3>
                <span class="auth__span">Используйте вашу электронную почту для входа</span>
                <button class="auth__login" @click="regToEnter">Войти</button>
                <!-- закрытие модального окна -->
                <span class="auth__close" @click="userData.offShowSuccess()">
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M10.5859 12L2.79297 4.20706L4.20718 2.79285L12.0001 10.5857L19.793 2.79285L21.2072 4.20706L13.4143 12L21.2072 19.7928L19.793 21.2071L12.0001 13.4142L4.20718 21.2071L2.79297 19.7928L10.5859 12Z" fill="black"/>
                    </svg>
                </span>
            </div>
        </div>
    </header>
</template>

<style scoped>
    .header{
        display: flex;
        align-items: center;
        justify-content: space-between;
        margin-bottom: 32px;
    }

    .header__nav-mobile{
        display: none;
    }

    .logo{
        display: flex;
        gap: 12px;
        align-items: center;
        margin: 0;
        padding: 0;
    }

    .header__content{
        display: flex;
        align-items: center;
        gap: 40px;
    }

    .header__list{
        display: flex;
        gap: 40px;
        align-items: center;
    }

    .header__list-link{
        text-decoration: none;
        color: #fff;
        font-weight: 400;
        font-size: 24px;
        line-height: 32px;
    }

    .header__list-underline{
        border-bottom: 1.5px solid #DC5DFC;
        padding-bottom: 8px;
    }

    .header__btn{
        color: #fff;
        background-color: inherit;
        border: none;
        outline: none;
        font-weight: 400;
        font-size: 24px;
        line-height: 32px;
        margin: 0;
        padding: 0;
        cursor: pointer;
    }

    .header__search{
        position: relative;
    }

    .header__search--input{
        background-color: #393B3C;
        padding: 12px 52px;
        font-weight: 400;
        font-size: 18px;
        line-height: 24px;
        border-radius: 8px;
        color: #fff;
        width: 545px;
        max-width: 100%;
    }

    .header__search--lupa{
        position: absolute;
        left: 16px;
        top: 12px;
    }

    .auth{
        display: flex;
        position: fixed;
        top: 0;
        left: 0;
        width: 100%;
        height: 100%;
        background-color: rgba(0, 0, 0, 0.5);
        justify-content: center;
        align-items: center;
        z-index: 1000;
    }

    .auth__content{
        background-color: #fff;
        border-radius: 24px;
        padding: 64px 40px;
        display: flex;
        flex-direction: column;
        justify-content: center;
        position: relative;
    }

    .auth__logo{
        display: flex;
        gap: 13px;
        align-items: center;
        padding-bottom: 40px;
        align-self: center;
    }

    .auth__title{
        display: none;
        color: #000;
        font-weight: 700;
        font-size: 24px;
        line-height: 32px;
        padding-bottom: 24px;
    }

    .auth__span{
        color: #000;
        font-weight: 400;
        font-size: 18px;
        line-height: 24px;
        padding-bottom: 24px;
    }

    .auth__form{
        display: flex;
        flex-direction: column;
        gap: 24px;
        padding-bottom: 24px;
    }

    .auth__inputs{
        display: flex;
        flex-direction: column;
        gap: 12px;
    }

    .auth__input-wrap{
        position: relative;
        color: #00000066;
    }

    .auth__reg{
        display: none;
    }

    .auth__input--svg{
        position: absolute;
        top: 10px;
        left: 16px;
        fill: black;
    }

    .auth__input{
        padding: 16px 52px;
        min-width: 340px;
        position: relative;
        border-radius: 8px;
        border: #00000066 1px solid;
    }

    .auth__input:focus{
        border: #B4A9FF 1px solid;
    }

    .auth__input:focus + .auth__input--svg{
        fill: #B4A9FF;
    }

    .auth__input::placeholder{
        font-weight: 400;
        font-size: 18px;
        line-height: 24px;
        color: #00000066;
    }

    .auth__login{
        color: #FFFFFF;
        background-color: #67A5EB;
        padding: 16px 0;
        font-weight: 700;
        font-size: 18px;
        line-height: 24px;
        border-radius: 28px;
        border: none;
        cursor: pointer;
    }

    .auth__register{
        color: #000000;
        font-weight: 700;
        font-size: 18px;
        line-height: 24px;
        border: none;
        background: none;
        cursor: pointer;
    }

    /* неправильные инпуты */
    .wrong__input{
        border: 1px solid #FF7575;
    }

    .wrong__input > .wrong__input::placeholder{
        color: #00000066;
    }

    .wrong__svg{
        fill: #FF7575;
    }

    /* вторая модалка */
    .register{
        display: none;
        position: fixed;
        top: 0;
        left: 0;
        width: 100%;
        height: 100%;
        background-color: rgba(0, 0, 0, 0.5);
        justify-content: center;
        align-items: center;
        z-index: 1000;
    }

    .register__content{
        background-color: #fff;
        border-radius: 24px;
        padding: 64px 40px;
        display: flex;
        flex-direction: column;
        justify-content: center;
        align-items: center;
        position: relative;
    }

    .auth__close{
        position: absolute;
        padding: 12px;
        background-color: #fff;
        border-radius: 24px;
        top: 0;
        right: -72px;
        cursor: pointer;
    }

    /* поиск */
    .search{
        display: none;
        position: absolute;
        max-width: 559px;
        width: 100%;
        background-color: #393B3C;
        border-radius: 8px;
        padding: 8px;
        right: 3px;
        top: 60px;
    }

    .search__list{
        margin: 0;
        padding: 0;
        display: flex;
        flex-direction: column;
        overflow-y: auto;
        max-height: 476px;
    }

    .search__list::-webkit-scrollbar{
        display: none;
    }

    @media (max-width: 720px) {
        .header{
            gap: 0;
            justify-content: space-between;
            padding: 16px 0;
            margin-bottom: 16px;
        }

        .logo__image{
            width: 18px;
            height: 18px;
        }

        .logo__svg{
            width: 56px;
            height: 12px;
        }

        .header__content{
            display: none;
        }

        .header__btn{
            display: none;
        }

        .header__nav-mobile{
            display: flex;
            gap: 20px;
        }
    }

</style>